app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" LIMIT 10 OFFSET 0) subquery_for_count
---
	def index
	# 	if params[:page]
	# 	   @posts =Post.order(created_at: :desc).page(params[:page])#.limit(10)
	#
  #   else
	# 		@posts= Post.all
	# 	end
		@posts = Post.order(created_at: :desc).page(params[:page])