app/controllers/posts_controller.rb

	def index
	# 	if params[:page]
	# 	   @posts =Post.order(created_at: :desc).page(params[:page])#.limit(10)
	#
  #   else
	# 		@posts= Post.all
	# 	end
		#@posts = Post.order(created_at: :desc).page(params[:page])
		@posts = Post.all
---
SELECT "posts".* FROM "posts"